api/app/controllers/investors_controller.rb

  def index
    render json: Investor.all.map { |investor| investor_mapper(investor) }
---
SELECT `investors`.* FROM `investors`

  def create
    puts "CREATE params = #{JSON.pretty_generate(params)}"
    investor = Investor.new(
      {
        first_name: params[:first_name],
        last_name: params[:last_name],
        date_of_birth: params[:date_of_birth].to_date,
        phone: params[:phone],
        address_1: params[:address_1],
        address_2: params[:address_2],
        state: params[:state],
        zip: params[:zip]
      }
    )
    investor.save!
---
INSERT INTO `investors` (`first_name`, `last_name`, `date_of_birth`, `phone`, `address_1`, `address_2`, `state`, `zip`, `created_at`, `updated_at`) VALUES (NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2025-05-11 17:40:59.362281', '2025-05-11 17:40:59.362281')

  def edit
    puts "EDIT params = #{JSON.pretty_generate(params)}"
    investor = Investor.find(params[:investor_id])
    render json: { success: false } if investor.nil?

    investor.assign_attributes(
      {
        first_name: params[:first_name],
        last_name: params[:last_name],
        date_of_birth: params[:date_of_birth].to_date,
        phone: params[:phone],
        address_1: params[:address_1],
        address_2: params[:address_2],
        state: params[:state],
        zip: params[:zip]
      }
    )
    investor.save!
---
SELECT `investors`.* FROM `investors` WHERE `investors`.`id` = 1 LIMIT 1
UPDATE `investors` SET `investors`.`first_name` = 'bobby', `investors`.`updated_at` = '2025-05-11 17:44:19.936316' WHERE `investors`.`id` = 1

  def delete
    investor = Investor.find(params[:investor_id])
    render json: { success: false } if investor.nil?

    investor.destroy
---
SELECT `investors`.* FROM `investors` WHERE `investors`.`id` = 1 LIMIT 1
DELETE FROM `investors` WHERE `investors`.`id` = 1